### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  - destroy

Terraform will perform the following actions:

  # cloudflare_record.hello-a-192-168-2-100 will be destroyed
  # (because cloudflare_record.hello-a-192-168-2-100 is not in configuration)
  - resource "cloudflare_record" "hello-a-192-168-2-100" {
      - allow_overwrite = false -> null
      - created_on      = "2023-05-10T14:50:11.413067Z" -> null
      - hostname        = "hello.mrugesh.net" -> null
      - id              = "350c202b8be3226f9372954ff83f49bb" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2023-05-10T14:50:11.413067Z" -> null
      - name            = "hello" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "192.168.2.100" -> null
      - zone_id         = (sensitive value) -> null
    }

  # cloudflare_record.hello-a-192-168-2-200 will be created
+   resource "cloudflare_record" "hello-a-192-168-2-200" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "hello"
+       proxiable       = (known after apply)
+       proxied         = false
+       ttl             = 1
+       type            = "A"
+       value           = "192.168.2.200"
+       zone_id         = (sensitive value)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>